---
kind: method
id: M:Autodesk.Revit.DB.ImageExportOptions.IsValidFileName(System.String)
source: html/f3618687-c964-60cc-a6a1-2ccd1f192ba9.htm
---
# Autodesk.Revit.DB.ImageExportOptions.IsValidFileName Method

Verify if File name is valid

## Syntax (C#)
```csharp
public static bool IsValidFileName(
	string filePath
)
```

## Parameters
- **filePath** (`System.String`) - File path to be tested for valid file name

## Returns
True if File name is valid; false otherwise

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null